app/controllers/sites_controller.rb

SELECT "sites".* FROM "sites" WHERE "sites"."deleted_at" IS NULL
---
  def index
    @sites = Site.all

INSERT INTO "sites" ("name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Farnborough Go Karts"], ["location", "Farnborough"], ["created_at", "2018-07-12 16:24:58.671428"], ["updated_at", "2018-07-12 16:24:58.671428"]]
---
  def create
    @site = Site.new(site_params)

    respond_to do |format|
      if @site.save

UPDATE "sites" SET "location" = $1, "updated_at" = $2 WHERE "sites"."id" = $3  [["location", "Farnborough, Hants"], ["updated_at", "2018-07-12 16:26:43.038552"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @site.update(site_params)

DELETE FROM "sites" WHERE "sites"."id" = $1  [["id", 2]]
---
  def destroy
    @site.destroy

SELECT  "sites".* FROM "sites" WHERE "sites"."deleted_at" IS NULL AND "sites"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_site
      @site = Site.find(params[:id])