app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"  ORDER BY "users"."id" ASC

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "roles_mask" = $1, "name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["roles_mask", 1], ["name", "Ben Hassana"], ["updated_at", "2018-07-19 12:24:58.576705"], ["id", 1]]