app/controllers/user_site_sessions_controller.rb

SELECT "users".* FROM "users"  ORDER BY "users"."id" ASC
---
  def new
    @user_site_session = UserSiteSession.new
    if can? :manage, 'User'
      @user = User.all

INSERT INTO "user_site_sessions" ("lap_time", "weather", "site_id", "user_id", "session_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["lap_time", "76.2"], ["weather", 0], ["site_id", 2], ["user_id", 1], ["session_date", "2018-07-16"], ["created_at", "2018-07-17 13:58:42.074641"], ["updated_at", "2018-07-17 13:58:42.074641"]]
---
  def create
    @user_site_session = UserSiteSession.new(user_site_session_params)

    if(current_user && current_user.user?)
        @user_site_session.user_id = current_user.id
    end

    respond_to do |format|
      if @user_site_session.save

DELETE FROM "user_site_sessions" WHERE "user_site_sessions"."id" = $1  [["id", 1]]
---
  def destroy
    @user_site_session.destroy

SELECT  user_site_sessions.*, users.name as user_name, sites.name as venue_name FROM "user_site_sessions" INNER JOIN "users" ON "users"."id" = "user_site_sessions"."user_id" INNER JOIN "sites" ON "sites"."id" = "user_site_sessions"."site_id" AND "sites"."deleted_at" IS NULL WHERE "user_site_sessions"."id" = $1 LIMIT 1  [["id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 9]]
SELECT "sites".* FROM "sites" WHERE "sites"."deleted_at" IS NULL
SELECT "user_site_sessions".* FROM "user_site_sessions" WHERE "user_site_sessions"."user_id" = $1  [["user_id", 1]]
---
    def set_user_site_session
      if(current_user.user?)
      @user_site_session = UserSiteSession.select('user_site_sessions.*, users.name as user_name, sites.name as venue_name').joins(:user, :site).find(params[:id]);
      if @user_site_session.user_id != current_user.id
        redirect_to "/user_site_sessions"
      end
    end
      @user_site_session = UserSiteSession.find(params[:id])