app/views/user_site_sessions/_form.html.erb

  <div class="form-inputs">
    <%= f.input :user_id, collection: User.all, prompt: "Select User", selected: @user_site_session.user_id %>
---
SELECT "users".* FROM "users"  ORDER BY "users"."id" ASC

  <div class="form-inputs">
    <%= f.input :site_id, collection: Site.all, prompt: "Select Venue", label: 'Venue' %>
---
SELECT "sites".* FROM "sites" WHERE "sites"."deleted_at" IS NULL